inp_1 = input('Введите координаты первой клетки: ')
inp_2 = input('Введите координаты второй клетки: ')

if ((len(inp_1) == 2 and len(inp_2) == 2)
        and 'a' <= inp_1[0] <= 'h'
        and '1' <= inp_1[1] <= '8'
        and 'a' <= inp_2[0] <= 'h'
        and '1' <= inp_2[1] <= '8'):
    
    # эта строка тоже должна сработать т.к. выше уже была проверка на введенные символы
    # if inp_2[0] == inp_1[0] or inp_2[1] == inp_1[1]:
    
    if (
           inp_2[0] == inp_1[0] and '1' <= inp_2[1] <= '8'
        or inp_2[1] == inp_1[1] and 'a' <= inp_2[0] <= 'h'
    ):
        print('Да')
    else:
        print('Нет')

else:
    print('Введите корректно координаты')

# Нет
