-- Запросы к таблицам схемы world

-- 1. Вывести названия стран и названия сопоставленных им столиц
select country.name as 'Страна', 
       city.name as 'Столица'
  from country 
  join city 
    on country.capital = city.id;
    
-- +---------------------------------------+-----------------------------------+
-- | Страна                          | Столица                    |
-- +---------------------------------------+-----------------------------------+
-- | Aruba                                 | Oranjestad                        |
-- | Afghanistan                           | Kabul                             |
-- | Angola                                | Luanda                            |
-- | Anguilla                              | The Valley                        |
-- | Albania                               | Tirana                            |
-- | Czech Republic                        | Praha                             |
-- | Germany                               | Berlin                            |
-- | Djibouti                              | Djibouti                          |
-- | Dominica                              | Roseau                            |
-- | Denmark                               | København                         |
-- | Dominican Republic                    | Santo Domingo de Guzmán           |
-- | Algeria                               | Alger                             |
-- | Ecuador                               | Quito                             |
-- | Egypt                                 | Cairo                             |
-- | Eritrea                               | Asmara                            |
-- | Western Sahara                        | El-Aaiún                          |
-- ................................................................................
-- | Russian Federation                    | Moscow                            |
-- | Rwanda                                | Kigali                            |                        |
-- | Yugoslavia                            | Beograd                           |
-- | South Africa                          | Pretoria                          |
-- | Zambia                                | Lusaka                            |
-- | Zimbabwe                              | Harare                            |
-- +---------------------------------------+-----------------------------------+
-- 232 rows in set (0.0010 sec)

-------------------------------------------------------------------------------------------------
-- 2. Сравнить по регионам сумму населения стран и сумму населения городов
-- возможно неправильно понял условие
select sum(country.population) - sum(city.population) as 'Нас. стран - нас. городов'
  from country
  join city
    on country.code = city.countrycode
 group by region;
 
 -- +---------------------------+
-- | Нас. стран - нас. городов |
-- +---------------------------+
-- |                 277703450 |
-- |              363457732030 |
-- |                1107324225 |
-- |                5892084442 |
-- |                5447126026 |
-- |               48360987141 |
-- |                    800125 |
-- |                 286004264 |
-- |               10585925902 |
-- |                1537576934 |
-- |                7496767968 |
-- |               33347672284 |
-- |               17179992036 |
-- |               77704892133 |
-- |               31930949775 |
-- |                1768680808 |
-- |              499404187466 |
-- |                 211622313 |
-- |                4133421486 |
-- |                  25696360 |
-- |                   5987541 |
-- |                    822671 |
-- |                4813999886 |
-- +---------------------------+
-- 23 rows in set (0.0303 sec)

-------------------------------------------------------------------------------------------------------
-- 3. Вывести десять языков, на которых разговаривает больше всего людей
select language
from country as c
join countrylanguage as cl
on c.code = cl.countrycode
group by language
order by sum(population * (percentage / 100)) desc
limit 10;

-- +------------+
-- | language   |
-- +------------+
-- | Chinese    |
-- | Hindi      |
-- | Spanish    |
-- | English    |
-- | Arabic     |
-- | Bengali    |
-- | Portuguese |
-- | Russian    |
-- | Japanese   |
-- | Punjabi    |
-- +------------+
-- 10 rows in set (0.0029 sec)
-------------------------------------------------------------------------------------------------

-- 4. Вывести названия специальностей и суммарное количество дней отпусков, в которых были врачи 
-- каждой специальности; отсортировать по возрастанию суммарного количества дней отпуска
 select s.specialization as `специальность`,
        sum(datediff(end_date, start_date)) as `дни отпуска`
   from specializations as s
   join specializations_doctors as sd
     on s.id = sd.specializations_id
   join doctors as d
     on sd.doctors_id = d.id
   join vacations as v
     on d.id = v.doctors_id
group by s.specialization
order by `дни отпуска`;

-- +-------------------+-------------+
-- | специальность     | дни отпуска |
-- +-------------------+-------------+
-- | Кардиолог         |       28262 |
-- | Оториноларинголог |       37585 |
-- | Анестезиолог      |       41968 |
-- | Эндокринолог      |       54817 |
-- | Иммунолог         |       60994 |
-- | Стоматолог        |       69697 |
-- | Дерматолог        |       77071 |
-- | Онколог           |       78663 |
-- | Ортопед           |       91959 |
-- | Травматолог       |      106294 |
-- | Нарколог          |      115715 |
-- | Диетолог          |      131099 |
-- | Уролог            |      182896 |
-- | Реаниматолог      |      186337 |
-- | Хирург            |      203188 |
-- | Невролог          |      217197 |
-- | Офтальмолог       |      303211 |
-- +-------------------+-------------+
-- 17 rows in set (0.0189 sec)

----------------------------------------------------------------------------------------------------------
-- 5. Вывести округлённую до целого сумму средств, которую можно выделить на одну палату этого отделения 
-- (в зависимости от количества палат в отделении), от всех пожертвований каждому отделению; 
-- отсортировать по убыванию найденной суммы
select round(sum(`don`.amount) / count(`w`.id)) as `Пожертвование на одну палату`
  from wards as `w`
  join departments as `dep`
   on `w`.departments_id = `dep`.id
  join donations as `don`
   on `don`.departments_id = `dep`.id
 group by `dep`.id
 order by `Пожертвование на одну палату` desc;

-- +------------------------------+
-- | Пожертвование на одну палату |
-- +------------------------------+
-- |                      1302129 |
-- |                      1177165 |
-- |                      1096349 |
-- |                      1058915 |
-- |                       992472 |
-- |                       761388 |
-- |                       657766 |
-- +------------------------------+